<!DOCTYPE html>
<html>
<head>
    <meta charset="UTF-8">
    <title>Основы HTML</title>
</head>
<body>
<h1>Основы HTML. Список заданий по курсу:</h1>
<p>
	7. Создать страницу, которая будет служить заготовкой для дальнейших заданий. Веб страница должна содержать заголовок страницы Personal Web Page - Exercise. В теле документа необходимо написать что вдохновило Вас заняться веб-разработку. Этот текст должен иметь свой заголовок, который соответствует смыслу текста.
</p>
<p>
9. В веб-документ из предыдущего задания добавить мета теги для ключевых слов и описания страницы
</p>
<p>
10. В веб-документе из предыдущего задания отформатировать текст. В каждом абзаце сделать второе слово жирным и курсивом, а последнее слово сделать подчеркнутым.
</p>
<p>
11. В веб-документе при помощи символов "-", "|" изобразить букву "i".
</p>
<p>
12. Создать веб-документ с тегами верхнего уровня. Добавить на созданные документ следующий текст: <img> - tag for images
</p>
<p>
13. Создать веб-документ, в котором будет некоторый текст, разбитый по абзацам. В первый абзац изображение планеты Земля, найденного в интернете. Текст должен обтекать изображение по правому его краю и ширина изображения должна быть 50.
</p>
<p>
14. В веб-документе предыдущего задания сделать картинку с планетой - ссылкой, которая ведет на страницу с результатом поиска в Google по слову Earth. Ссылка должна открыться в новой вкладке.
</p>
<p>
15. Создать веб документ с тегами верхнего уровня. В теле создать список континентов и для каждого элемента списка перечислить не более трех стран из этого континента. Вложенный список должен быть маркированным, а внешний - нумерованным
</p>
<p>
16. Создать таблицу из двух столбцов в которой будут записаны континенты и их площадь. Первая строка таблицы должна состоять из одной ячейки и содержать текст Some continents and area
</p>
<p>
18. Создать новый веб документ. В нем создать заголовок и таблицу 5х2 с полями формы. В форме должны быть поля Name, Email, Phone, Message. Поля Message и кнопка отправки данных должны занимать ширину двух столбцов.
</p>
<p>
19. В форму из предыдущего задания добавить новые элементы: Gender - для выбора пола, и Application For - для выбора типа заявки c несколькими вариантами, которые можно комбинировать
</p>
<p>
20. Добавить в форму из предыдущего задания выпадающий список для определения страны. По умолчанию должен быть выставлен элемент с текстом Select your country
</p>
<p>
21. Добавить в форму веб документа из предыдущего задания скрытый элемент, который содержит значение даты.
</p>
<p>
22.В форму веб-документа из предыдущего задания добавить поле для загрузки резюме
</p>
</body>
</html>