<!DOCTYPE html>
<html>
<head>
    <meta charset="UTF-8">
    <title>Основы CSS</title>
</head>
<body>
<p>
2. Создать пустой файл index.html. В нем создать теги верхнего уровня в качестве основной структуры разметки. Создать пустой файл style.css и поместить его в каталог css в корне проекта. Подключить стилевой файл в теге <head> документа index.html
</p>
<p>
3. В рамках предыдущего задания, добавить в стилевой файл style.css следующие селекторы и правила: Универсальный селектор: Задать шрифт Tahoma. Селектор тега ссылок : Задать цвет ссылок как #0074A2. Селектор класса bar: Задать границу красного цвета. В документе index.html добавить контент с использованием соответствующих элементов.
</p>
<p>
4. В рамках предыдущего задания задать цвет текста #FF3399 для всех тегов <b> которые находятся внутри класса bar. Использовать этот тег в нужном контексте в веб-документа index.html. Для ссылок задать изменение цвета на #003300 при наведении на них курсора.
</p>
<p>
5. Создать стилевые свойства для классов с названиями bold, italic, underlined, которые имели бы свойства, эквивалентные тегам <b>, <i> <u>. В документе index.html каждый из этиx классов применить в теге <span>.
</p>
<p>
6. Разместить в документе index.html блоки div так, чтоб блок container содержал теги header, navigation, content, footer, которые идут по порядку. В каждом из тегов header, navigation, content, footer создать тестовый контент содержащий название идентификатора.
</p>
<p>
7. В рамках предыдущего задания задать в container правила фиксированной ширины 1000px, выравнивания блока по центру экрана и внутренние отступы величиной 1px. Для header, footer, navigation задать внешние отступы равные 20px и внутренние отступы равные 10px. Для content задать внутренние отступы равные 20px; Для header задать высоту блока 50px, выравнивание текста по правому краю и форматировку текста курсивом. Для footer задать высоту блока равную 40px и выравнивание текста по центру.
</p>
<p>
8. Создать класс contact-form с правилами выравнивания блока по центру родительского элемента, фиксированной ширины 700px и внутренними отступами в 10px. Задать следующие правила для границы этого блока: толщина 2px, тип границы - цельный, цвет #444. Разместить блок этого класса внутри container вместо текстового текста. Внутри блока добавить тестовый текст That would be a form. В блок navigation вместо тестового текста добавить ссылки Home, About us, Contact. Также, задать в этом блоке цельные границы сверху и снизу цвета #EDEDED, добавить внутренние границы равные 10px.
</p>
<p>
9. Задать фоновый цвет <body> как #E5E5E5. Задать белый фон container. Задать фон header как #BCBE97, фон footer как #F2F2F2.
</p>
<p>
10. Создать стилевые правила для класса flower, при которых элемент будет "плыть" вправо. Создать следующие стилевые правила для тега img внутри блока этого класса: высота 50px; внешние отступ слева 50px. Используя рисунок вставить блок flower с рисунком в header так, чтоб он прижимался к левой границе header. Тег рисунка должен быть помещен в блок класса flower. Файл рисунка поместить в папку img в корне проекта. Создать тег формы. Внутри блока contact-form перед формой вставить заголовок с текстом Contact Form, цвет текста #403E3F.
</p>
<p>
</p>
<p>
</p>
</body>
</html>