<!DOCTYPE>
<html>
<head>
	<meta charset="utf-8"/>
	<title>Javascript and jQuery</title>
<body>
<h1>Javascript and jQuery</h1>
<p>
3. Составить алгоритм для вычисления значения площади прямоугольника со сторонами a, b. Увеличить полученное значение на 1. Проверить значения при помощи функции alert (var).
</p>
<p>
4. Вычислить значения логических выражений: 1) true && false || true; 2) true || false && true; 3) false && (!false || true); 4) (1 > 0) && (1 < 0). Результаты записать в отдельные переменные и вывести их значение при помощи функции alert (var).
</p>
<p>
5. Объявить переменную a с целым числовым значением. Объявить еще одну переменную b. В нее записать булевское выражение, которое будет равно true если значение переменной a делится на 2 и false в противном случае. Результат проверить при помощи функции alert ().
</p>
<p>
6. 
</p>
<p>

</p>
<p>

</p>
<p>

</p>
<p>

</p>
<p>

</p>
<p>

</p>
<p>

</p>
</body>
</html>