<!DOCTYPE html>
<html>
<head>
    <meta charset="UTF-8">
    <title>Title</title>
</head>
<body>

<p>
    18. Создать массив из названий 5 стран мира. Вывести массив на экран при помощи print_r внутри тегов &lt;pre&gt;&lt;/pre&gt;
</p>
<p>
    19. Создать ассоциативный массив из 5 элементов, в котором ключи - это названия стран, а значения элементов - это столицы стран. Вывести массив на экран.
</p>
<p>
    20. Создать многомерный массив, который иллюстрирует список товаров. Каждый товар - это книга (художественная литература). Каждая книга имеет стиль, автора, название и цену. В списке товаров должно быть не менее 3 книг.
</p>
<p>
    23. Создать скрипт, который бы вывел на экран значение переменной $$$$$hello. Значение может быть любым.
</p>
<p>
    28. Создать форму, которая содержит поля name, email, phone. Задать скрипт, который выведет на экран отправленные данные - $_POST или $_GET (в зависимости от свойств формы)
</p>
<p>
    31. Создать форму с полями username, email, message. Сериализовать данные, полученные при отправке формы и вывести полученную строку на экран.
</p>
<p>
    33. Вычислить количество секунд в году и присвоить это значение переменной. Вычислить остаток от деления этого значения на 2
</p>
<p>
    35. Создать строку, содержащую число 12345 используя лишь отдельные цифры 1,2,3,4,5 и операцию конкатенации
</p>
<p>
    36. Вычислить значение выражения: false && true || false && true || !false && true<br/>
    Вывести на экран true/false в зависимости о того, делится переменная $x на 2 или нет.
</p>
<p>
    37. Создать алгоритм обмена значениями двух переменных не используя третьей.
</p>
<p>
    44. Создать алгоритм вычисления максимального значения двух заданных переменных
</p>
<p>
    45. Создать алгоритм вычисления максимального значения двух заданных переменных при помощи тернарного оператора
</p>
<p>
    46. Создать алгоритм вычисления максимального значения двух переменных при помощи switch
</p>
<p>
    47. Создать алгоритм определения всех простых чисел в промежутке от 1 до 100 при помощи for. Простое число - это число которое делится только на себя и на 1
</p>
<p>
    48. Создать алгоритм определения всех простых чисел в промежутке от 1 до 100 при помощи while. Простое число - это число которое делится только на себя и на 1
</p>
<p>
    49. Создать массив из 10 любых числовых значений. При помощи foreach вывести на экран те значения, которые делятся на 3
</p>
<p>
    50. Выполнить предыдущие задания при помощи альтернативного синтаксиса
</p>
<p>
    51. Создать алгоритм для определения первого найденного простого числа в промежутке от 200 до 400.
</p>
<p>
    52. Как можно упростить функцию test() в данном скрипте?<br/>
    <i>function test($x, $y) { ($y==0)? return false : return $x/$y; }</i>
</p>
<p>
    55. Создать текстовый файл, в котором будет 10 строк. В первой строке записать 1, во второй 22, в третьей 33, ..., в десятой - десять десяток
</p>
<p>
	66. Создать функцию, которая будет выводить на экран массив внутри тегов &lt;pre&gt;&lt;/pre&gt;
</p>
<p>
	67. Создать функцию, которая будет выводить на экран массив внутри тегов &lt;pre&gt;&lt;/pre&gt; В зависимости от значения второго аргумента функции, выводить используя var_dump или print_r. По умолчанию использовать print_r
</p>
<p>
	69. Создать функцию, которая принимает один аргумент в виде массива и дописывает в него последним элементом количество значений массива
</p>
<p>
	70. Реализовать функцию, которая определяет, будет ли число простым числом
</p>
<p>
	71. Определить рекурсивную функцию - аналог функции print_r
</p>
</body>
</html>